In [4]:
import pandas as pd

course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']

duration = [2,3,6,4]

df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

<h>ans_1

In [7]:
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

<h>ans_2

In pandas, loc and iloc are used to select rows and columns from a DataFrame.

loc is primarily label based, which means that we have to specify the name of the row or column which we want to select. It selects data based on row and column labels, where the row label is based on the DataFrame's index, and the column label is based on the column name.

In [8]:
df.loc[2, 'duration']

6

iloc, on the other hand, is primarily integer position based, which means that we have to specify the integer location of the rows and columns which we want to select. It selects data based on the integer position of the row and column

In [9]:
df.iloc[1, 0]

'Machine Learning'

<h>ans_3

In [23]:
reindex = [3, 0, 1, 2]
new_df = pd.DataFrame(df,index = reindex)
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [13]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [14]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

Yes, there is a difference in the outputs of both the commands new_df.loc[2] and new_df.iloc[2].

new_df.loc[2] returns the row of data that has the label or index value equal to 2. In the original DataFrame df, the row with index 2 had the data ['Big Data', 6]. But after reindexing, the row with index 2 is now holding the data of original row with index 1 [Machine Learning ,	3]. So, new_df.loc[2] will return the data of row no. 4 after reindexing, which is ['Big Data', 6].

new_df.iloc[2] returns the row of data that is present at the 2nd position (i.e. the 3rd row), regardless of the row label or index. After reindexing, the 3rd row in new_df holds the data [Machine Learning	 ,3]. So, new_df.iloc[2] will return the data of 3rd row after reindexing, which is [Machine Learning,3].while df.iloc[2] would return ['Big Data', 6],

In [27]:
import pandas as pd

import numpy as np

columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']

indices = [1,2,3,4,5,6]


df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.358679  0.741462  0.802006  0.368016  0.187209  0.229352
2  0.862080  0.160961  0.252304  0.018867  0.639481  0.835618
3  0.862244  0.607239  0.273640  0.980067  0.825870  0.401787
4  0.228381  0.712734  0.006635  0.389250  0.224646  0.205172
5  0.888652  0.047727  0.132019  0.986818  0.006158  0.603595
6  0.908953  0.538905  0.452693  0.125596  0.784114  0.881039

<h>ans_4

In [28]:
means = df1.mean()
print(means)

column_1    0.684831
column_2    0.468171
column_3    0.319883
column_4    0.478102
column_5    0.444580
column_6    0.526094
dtype: float64

In [31]:
std_d = df1['column_2'].std()
print(std_d)

0.29325531646567543

<h>ans_5

In [32]:
df1.loc[2, 'column_2'] = 'some string'

In [33]:
 df1.mean()

TypeError: unsupported operand type(s) for +: 'float' and 'str'

Since the values in 'column_2' are float type, it is not sensible to replace it with a string variable. It will result in a TypeError.if we had changed it some sensable string which can be converted to float thenwe can still find mean.

In [40]:
df1.loc[2, 'column_2'] = '4.367'
df1['column_2'] = df1['column_2'].astype(float) # converting back to float type
df1['column_2'].mean()

1.1691779205446853

<h>ans_6

In pandas, window functions are used to perform operations on a moving window of data points. A window function can be applied to a rolling or expanding window of data points based on a specified window size and a set of aggregation functions. These functions are especially useful in time-series analysis and data manipulation tasks.

There are several types of window functions available in pandas, some of them are:

Rolling Window: This window function is used to perform calculations on a fixed-size moving window of the DataFrame.

Expanding Window: This window function is used to perform calculations on all data points in the DataFrame up to a certain point.

Exponential Moving Window: This window function assigns exponentially decreasing weights to each data point in the window.

Rolling Apply: This window function is used to apply custom functions to rolling windows.

Rolling Sum, Mean, Min, Max: These are some of the basic aggregation functions that can be used with the rolling window function

<h>ans_7

In [47]:
pd.datetime

AttributeError: module 'pandas' has no attribute 'datetime'

The pandas.datetime function has been deprecated and replaced by pandas.Timestamp

In [48]:
now = pd.Timestamp.now()
now

Timestamp('2023-05-07 23:48:16.872671')

In [52]:
now.month ,now.year ,

(5, 2023)

<h>ans_8

In [53]:
import pandas as pd


date1_str = input("Enter the first date in YYYY-MM-DD format: ")
date2_str = input("Enter the second date in YYYY-MM-DD format: ")

# Convert input strings to Pandas datetime objects
date1 = pd.to_datetime(date1_str)
date2 = pd.to_datetime(date2_str)


time_diff = date2 - date1

# Extract days, hours, and minutes from the time difference
days = time_diff.days
hours = time_diff.seconds // 3600
minutes = (time_diff.seconds % 3600) // 60


print(f"The difference between {date1_str} and {date2_str} is {days} days, {hours} hours, and {minutes} minutes.")

Enter the first date in YYYY-MM-DD format: 2003-04-29
Enter the second date in YYYY-MM-DD format: 2005-6-12
The difference between 2003-04-29 and 2005-6-12 is 775 days, 0 hours, and 0 minutes.

<h>ans_9

In [60]:
import pandas as pd


file_path = input("Enter file path: ")
column_name = input("Enter column name: ")
category = input("Enter category: ")

#
df = pd.read_csv(file_path)

# Convert specified column to categorical data type
df[column_name] = df[column_name].astype('category')

# Assign category to specified column
df[column_name] = df[column_name].cat.set_categories([category])

# Sort data based on specified column
df = df.sort_values(column_name)

df

Enter file path: titanic.csv
Enter column name: Sex
Enter category: female

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
571,572,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S
567,568,0,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.0750,NaN,S
564,565,0,3,"Meanwell, Miss. (Marion Ogden)",female,NaN,0,0,SOTON/O.Q. 392087,8.0500,NaN,S
559,560,1,3,"de Messemaeker, Mrs. Guillaume Joseph (Emma)",female,36.0,1,0,345572,17.4000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",NaN,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",NaN,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",NaN,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",NaN,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",NaN,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# 1.titanic.csv
# 2.Sex
# 3.female
##pd.read_html("https://github.com/datasciencedojo/datasets/blob/master/titanic.csv")[0]

<h>ans_10